Repository: y0ung-jg-1/RightAgent
Catalog: RightAgent.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# WindowTitle
source: RightAgent Settings
zh_cn: RightAgent 设置

# MasterSwitch
source: Enable RightAgent
zh_cn: 启用 RightAgent

# MenuOff
source: (Menu is off)
zh_cn: （菜单已关闭）

# SaveFailed
source: Could not save settings
zh_cn: 保存失败

# MenuSection
source: Context menu
zh_cn: 右键菜单

source: Menu mode
zh_cn: 菜单模式

# Grouped
source: Open with RightAgent (grouped)
zh_cn: 使用 RightAgent 打开（分组）

# Direct
source: Open with one agent (direct)
zh_cn: 使用单个 Agent 打开（直达）

# MultiDirect
source: Open with multiple agents (multi-direct)
zh_cn: 使用多个 Agent 打开（多个直达）

source: Direct agent
zh_cn: 直达 Agent

# TerminalProfile
source: Windows Terminal profile
zh_cn: Windows Terminal 配置文件

# TerminalProfileHelp
source: Opens that Terminal profile, including its own shell, icon, and colors.
zh_cn: 用这个配置文件打开标签页，包括它自己的 Shell、图标和配色。

# TerminalProfileDefault
source: Use Terminal default
zh_cn: 使用 Terminal 默认

# TerminalProfileDefaultNamed
source: Use Terminal default ({0})
zh_cn: 使用 Terminal 默认（{0}）

# TerminalRequiredTitle
source: Windows Terminal is required
zh_cn: 需要安装 Windows Terminal

# TerminalRequiredBody
source: RightAgent uses Windows Terminal to open agents. Windows Terminal was not detected on this PC. Install it from Microsoft Store first.
zh_cn: RightAgent 使用 Windows Terminal 打开 Agent。此电脑未检测到 Windows Terminal，请先从 Microsoft Store 安装。

# InstallFromStore
source: Open Microsoft Store
zh_cn: 前往 Microsoft Store

# InstallLater
source: Later
zh_cn: 稍后

# TerminalStoreOpenFailed
source: Could not open the Windows Terminal page in Microsoft Store. Search for “Windows Terminal” in the Store manually.
zh_cn: 无法打开 Windows Terminal 的 Microsoft Store 页面。请在商店中手动搜索“Windows Terminal”。

# Preview
source: Menu preview
zh_cn: 菜单预览

# AgentsSection
source: Agents
zh_cn: Agent

source: Add agent
zh_cn: 添加 Agent

# NoAgents
source: No agents yet. Add a terminal command or web action.
zh_cn: 还没有 Agent。添加一个终端命令或网页动作。

# GeneralSection
source: General
zh_cn: 常规

# Language
source: App and menu language
zh_cn: 界面与菜单语言

# SystemLanguage
source: Use system language
zh_cn: 跟随系统

source: Name
zh_cn: 名称

source: Action type
zh_cn: 动作类型

# ActionValue
source: Command or URL
zh_cn: 命令或 URL

source: Terminal command
zh_cn: 终端命令

# Url
source: Web URL
zh_cn: 网页 URL

source: Choose icon
zh_cn: 选择图标

source: Move up
zh_cn: 上移

source: Move down
zh_cn: 下移

source: Delete
zh_cn: 删除

# ManageAgent
source: Arrange
zh_cn: 调整

# DeleteTitle
source: Delete agent?
zh_cn: 删除 Agent？

# DeleteBody
source: This removes the agent from the RightAgent configuration.
zh_cn: 此操作会从 RightAgent 配置中删除该 Agent。

source: Cancel
zh_cn: 取消

source: New agent
zh_cn: 新 Agent

# ValidationDirect
source: Direct mode requires an enabled agent.
zh_cn: 直达模式需要选择一个已启用的 Agent。

# ValidationMultiDirectLimit
source: Multi-direct mode supports up to 16 enabled agents.
zh_cn: 多个直达模式最多支持 16 个已启用的 Agent。

# VersionFormat
source: Version {0}
zh_cn: 版本 {0}

# ValidationTitle
source: Fix the following
zh_cn: 请先解决以下问题

# ErrorNameRequired
source: Enter a name.
zh_cn: 输入名称。

# ErrorActionRequired
source: An enabled agent needs a command or URL.
zh_cn: 已启用的 Agent 需要命令或 URL。

# ErrorUrlInvalid
source: The URL must start with http:// or https://.
zh_cn: URL 必须以 http:// 或 https:// 开头。

# UnnamedAgent
source: (Unnamed)
zh_cn: （未命名）

source: Open with RightAgent
zh_cn: 使用 RightAgent 打开

# OpenWithAgent
source: Open with {0}
zh_cn: 使用 {0} 打开

# PreviewEmpty
source: (No enabled agents — the menu is hidden)
zh_cn: （没有已启用的 Agent，菜单将隐藏）

# EnableFor
source: Enable {0}
zh_cn: 启用 {0}

# MoveUpFor
source: Move {0} up
zh_cn: 上移 {0}

# MoveDownFor
source: Move {0} down
zh_cn: 下移 {0}

# DeleteFor
source: Delete {0}
zh_cn: 删除 {0}

# ChooseIconFor
source: Choose icon for {0}
zh_cn: 为 {0} 选择图标

# IconFor
source: Icon for {0}
zh_cn: {0} 的图标
